Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Enable trending videos in your Discover feed
ja: Discoverフィードでトレンド・ビデオを有効にする

source: Enable {0} only
ja: {0}のみ有効にする

source: Enabled
ja: 有効

source: End of feed
ja: フィードの終わり

source: Ensure you have selected a language for each subtitle file.
ja: 各字幕ファイルに言語が選択されてることを確認してください。

source: Enter 6-digit code that was sent to your phone number
ja: あなたの電話番号に送信された6桁のコードを入力してください

source: Enter a password
ja: パスワードを入力

source: Enter a word or tag
ja: ワードまたはタグを入力

source: Enter code
ja: コードを入力

source: Enter fullscreen
ja: 全画面表示にする

source: Enter the 6-digit code sent to {prettyNumber}
ja: {prettyNumber} に送信された6桁のコードを入力してください

source: Enter the domain you want to use
ja: 使用するドメインを入力してください

source: Enter the email you used to create your account. We'll send you a "reset code" so you can set a new password.
ja: アカウントの作成に使用したメールアドレスを入力します。新しいパスワードを設定できるように、「リセットコード」をお送りします。

source: Enter the username or email address you used when you created your account
ja: アカウント作成時に使用したユーザー名またはメールアドレスを入力してください

source: Enter your birthdate
ja: 生年月日を入力してください

source: Enter your email address
ja: メールアドレスを入力してください

source: Enter your password
ja: パスワードを入力

source: Enter your username and password
ja: ユーザー名とパスワードを入力してください

source: Enters full screen
ja: フルスクリーンで表示

source: Entertainment
ja: エンターテインメント

source: Enum sets are “closed” and can not be updated or extended without breaking schema evolution rules. For this reason they should almost always be avoided.
ja: 列挙セットは「閉じている」ため、スキーマ進化ルールを破らずに更新または拡張することはできません。このため、ほとんどの場合で避けるべきです。

source: Error
ja: エラー

source: Error getting the latest data.
ja: 最新のデータの取得に失敗しました。

source: Error loading post
ja: 投稿の読み込みに失敗しました

source: Error loading preference
ja: 設定の読み込みに失敗しました

source: Error message
ja: エラーメッセージ

source: Error occurred while saving file
ja: ファイルの保存中にエラーが発生しました

source: Error receiving captcha response.
ja: CAPTCHAレスポンスの受信中にエラーが発生しました。

source: Error: {error}
ja: エラー：{error}

source: Essentially, you're building an in-memory search index of posts that match your criteria. You'll then serve this index as a feed.
ja: 要するに、条件に一致する投稿のインメモリ検索インデックスを構築し、それをフィードとして配信します。

source: Even though product development is centralized, the underlying data and identity remain open and universally accessible as a result of building on atproto. Put another way, ownership is clear for the evolution of a given application, but since the data is open, it can be reused, remixed, or extended by anyone else in the network.
ja: プロダクト開発が集権的であっても、atproto上に構築されているため、基盤となるデータとIDは開かれており普遍的にアクセス可能です。言い換えれば、特定アプリケーションの進化に関する所有権は明確ですが、データがオープンである以上、ネットワーク内の他の誰でも再利用・リミックス・拡張できます。

source: Every data repository contains JSON documents, which we'll call “records”.
ja: すべてのデータリポジトリには、JSONドキュメント（ここではレコードと呼びます）が含まれます。

source: Every node is an [IPLD](https://ipld.io/) object ([dag-cbor](https://ipld.io/docs/codecs/known/dag-cbor/)) which is referenced by a [CID](https://github.com/multiformats/cid) hash. The arrows in the diagram above represent a CID reference.
ja: すべてのノードは[IPLD](https://ipld.io/)オブジェクト（[dag-cbor](https://ipld.io/docs/codecs/known/dag-cbor/)）であり、[CID](https://github.com/multiformats/cid)ハッシュによって参照されます。上の図の矢印はCID参照を表します。

source: Everybody can reply
ja: 誰でも返信可能

source: Everybody can reply to this post.
ja: この投稿に全員が返信できる。

source: Everyone
ja: 全員

source: Everything else
ja: 他すべて

source: Exceptions may be justifiable in some situations, such as preservation of names in existing external schemas
ja: 既存の外部スキーマの名前を保持する場合など、例外が正当化されることもあります

source: Exclude users you follow
ja: フォローしているユーザーは除外

source: Excludes users you follow
ja: フォローしているユーザーは除外

source: Exit fullscreen
ja: 全画面表示を終了

source: Exits account deletion process
ja: アカウントの削除処理を終了

source: Exits image view
ja: 画像表示を終了

source: Expand alt text
ja: ALTテキストを展開

source: Expand list of users
ja: ユーザーリストを展開

source: Expand or collapse the full post you are replying to
ja: 返信する投稿全体を展開または折りたたむ

source: Expand post text
ja: 投稿のテキストを展開

source: Expands or collapses post text
ja: テキストを展開または折りたたむ

source: Expected uri to resolve to a record
ja: レコードを指すURIではありません

source: Experimental
ja: 実験的機能

source: Experimental schemas and projects can use variant NSIDs (eg, including `.temp.` in the name hierarchy) to develop in the live network without committing to a stable record data schemas.
ja: 実験的なスキーマとプロジェクトは、バリアントNSID（例：名前の階層に`.temp.`を含める）を使用することで、安定したレコードデータスキーマにコミットすることなく、動作中のネットワークで開発できます。

source: Expired
ja: 期限切れ

source: Expires in {0}
ja: {0}で期限切れ

source: Expires in {0} at {1}
ja: {0}で終了（{1}まで）

source: Expires {0}
ja: 期限：{0}

source: Explicit or potentially disturbing media.
ja: 露骨な、または不愉快になる可能性のあるメディア。

source: Explicit sexual images.
ja: 露骨な性的画像。

source: Explore
ja: 検索

source: Explore the app
ja: アプリを探索

source: Export My Data
ja: 私のデータをエクスポートする

source: Export my data
ja: 私のデータをエクスポートする

source: External Media
ja: 外部メディア

source: External Media Preferences
ja: 外部メディアの設定

source: External media
ja: 外部メディア

source: External media may allow websites to collect information about you and your device. No information is sent or requested until you press the "play" button.
ja: 外部メディアを有効にすると、それらのメディアのウェブサイトがあなたやお使いのデバイスに関する情報を収集する場合があります。その場合でも、あなたが「再生」ボタンを押すまで情報は送信されず、要求もされません。

source: Extremist content
ja: 過激主義的コンテンツ

source: Failed to accept chat
ja: チャットの受け入れに失敗しました

source: Failed to add emoji reaction
ja: 絵文字リアクションを追加できませんでした

source: Failed to add to starter pack
ja: スターターパックへの追加に失敗しました

source: Failed to change handle. Please try again.
ja: ハンドルの変更に失敗しました。もう一度試してください。

source: Failed to create app password. Please try again.
ja: アプリパスワードの作成に失敗しました。もう一度試してください。

source: Failed to create conversation
ja: 会話の作成に失敗しました

source: Failed to create starter pack
ja: スターターパックの作成に失敗しました

source: Failed to delete chat
ja: チャットの承認に失敗しました

source: Failed to delete message
ja: メッセージの削除に失敗しました

source: Failed to delete post, please try again
ja: 投稿の削除に失敗しました。もう一度お試しください。

source: Failed to delete starter pack
ja: スターターパックの削除に失敗しました

source: Failed to follow all suggested accounts, please try again
ja: すべての推奨アカウントをフォローできませんでした。もう一度やり直してください

source: Failed to follow all your friends, please try again
ja: すべての友達をフォローできませんでした。もう一度やり直してください

source: Failed to hide suggestion, please check your internet connection
ja: 提案を非表示にできませんでした。インターネット接続を確認してください

source: Failed to launch SMS app
ja: SMSアプリの起動に失敗しました

source: Failed to load GIFs
ja: GIFの読み込みに失敗しました

source: Failed to load conversations
ja: 会話の読み込みに失敗しました

source: Failed to load feeds preferences
ja: フィードの設定の読み込みに失敗しました

source: Failed to load notification settings.
ja: 通知設定の読み込みに失敗しました。

source: Failed to load past messages
ja: 過去のメッセージの読み込みに失敗しました

source: Failed to load preference.
ja: 設定の読み込みに失敗しました。

source: Failed to load suggested feeds
ja: おすすめのフィードの読み込みに失敗しました

source: Failed to load suggested follows
ja: おすすめのフォローの読み込みに失敗しました

source: Failed to mark all requests as read
ja: すべての要求を既読としてマークできませんでした

source: Failed to pin post
ja: 投稿の固定に失敗しました

source: Failed to remove data due to a network error, please check your internet connection.
ja: ネットワークエラーのためデータの削除に失敗しました。インターネット接続を確認してください。

source: Failed to remove data. {0}
ja: データの削除に失敗しました。 {0}

source: Failed to remove emoji reaction
ja: 絵文字リアクションの削除に失敗しました

source: Failed to remove from starter pack
ja: スターターパックからの削除に失敗しました

source: Failed to remove verification
ja: 認証の削除に失敗しました

source: Failed to resolve location. Please try again.
ja: 位置情報の調査に失敗しました。もう一度試してください。

source: Failed to save image: {0}
ja: 画像の保存に失敗しました：{0}

source: Failed to save settings. Please try again.
ja: 設定の保存に失敗しました。もう一度試してください。

source: Failed to save your interests.
ja: 「気になること」の保存に失敗しました。

source: Failed to send
ja: 送信に失敗

source: Failed to send email, please try again.
ja: メールの送信に失敗しました。後でもう一度お試しください。

source: Failed to submit appeal, please try again.
ja: 異議申し立ての送信に失敗しました。もう一度お試しください。

source: Failed to toggle thread mute, please try again
ja: スレッドのミュートの切り替えに失敗しました。もう一度お試しください

source: Failed to unpin list
ja: リストのピン留めの解除に失敗しました

source: Failed to update email 2FA settings
ja: メールでの2要素認証の設定の更新に失敗しました

source: Failed to update email, please try again.
ja: メールの更新に失敗しました。後でもう一度お試しください。

source: Failed to update feeds
ja: フィードの更新に失敗しました

source: Failed to update notification declaration
ja: 通知受信制限の更新に失敗しました

source: Failed to update settings
ja: 設定の更新に失敗しました

source: Failed to upload video
ja: ビデオのアップロードに失敗しました

source: Failed to verify email, please try again.
ja: メールの確認に失敗しました。後でもう一度お試しください。

source: Failed to verify handle. Please try again.
ja: ハンドルの変更に失敗しました。もう一度試してください。

source: Fake account or bot
ja: 偽のアカウントまたはボット

source: False information about elections
ja: 選挙に関する誤った情報

source: Feed
ja: フィード

source: Feed by {0}
ja: {0}によるフィード

source: Feed creator
ja: フィードの作者

source: Feed generators can also implement the `app.bsky.feed.sendInteractions` endpoint to receive input from users. These include likes, reposts, shares, and other interactions. See the [the app.bsky.feed Lexicon](https://github.com/bluesky-social/atproto/blob/main/lexicons/app/bsky/feed/defs.json#L247) for a complete list.
ja: フィードジェネレーターは`app.bsky.feed.sendInteractions`エンドポイントを実装することでユーザーからの入力を受け取ることができます。これにはいいね、リポスト、共有などのインタラクションが含まれます。完全な一覧は[app.bsky.feed Lexicon](https://github.com/bluesky-social/atproto/blob/main/lexicons/app/bsky/feed/defs.json#L247)を参照してください。

source: Feed identifier
ja: フィードの識別子

source: Feed menu
ja: フィードメニュー

source: Feed toggle
ja: フィードの切り替え

source: Feed unavailable
ja: フィードを利用できません

source: Feedback
ja: フィードバック

source: Feedback sent to feed operator
ja: フィードの運営者にフィードバックを送りました

source: Feeds
ja: フィード

source: Feeds are custom algorithms that users build with a little coding expertise. <0>See this guide</0> for more information.
ja: フィードは、ユーザーがちょっとしたコーディングの専門知識で構築できるカスタム・アルゴリズムです。詳細については、<0>こちらのガイド</0>をご覧ください。

source: Feeds updated!
ja: フィードを更新しました！

source: Feeds we think you might like.
ja: お気に入りになるかもしれないフィード。

source: Fetch update
ja: 更新を取得

source: Field names should stick to the same character set as schema names (NSID name segments): ASCII alphanumeric, first character not a digit, no hyphens, case-sensitive
ja: フィールド名はスキーマ名（NSIDの名前セグメント）と同じ文字セットに従う必要があります：ASCII英数字、最初の文字は数字ではない、ハイフンなし、大文字小文字を区別

source: File saved successfully!
ja: ファイルの保存に成功しました！

source: Fill out the reporting interface as desired. Make sure select your labeler as the moderation service to send the report to. Then, submit the report.
ja: 必要に応じて報告インターフェースに入力します。報告の送信先モデレーションサービスとしてラベラーを必ず選択してください。その後、報告を提出します。

source: Filter from feeds
ja: フィードからのフィルター

source: Filter search by language
ja: 言語で検索をフィルター

source: Filter search by language (currently: {currentLanguageLabel})
ja: 言語で検索をフィルター（現在の設定：{currentLanguageLabel}）

source: Filter who can opt to receive notifications for your activity
ja: あなたのアクティビティの通知について、誰が受信できるのかフィルターを設定します

source: Filter who you receive notifications from
ja: 通知を受け取るユーザーをフィルターする

source: Finalizing
ja: 最後に

source: Finally! Keep track of posts that matter to you. Save them to revisit anytime.
ja: ついに！気になる投稿を追いかけましょう。いつでも見返せるように保存。

source: Finally, add another code block inside of `main()` using the `cron` package to schedule your bot to post every three hours:
ja: 最後に、`cron`パッケージを使って、3時間ごとに投稿するコードを`main()`に追加します。

source: Finally, confirm that you will be using this account as a labeler service. This publishes an [AT Record](https://pdsls.dev/at://did:plc:wwjhjtgw5ksxrzdswtvnsnjs/app.bsky.labeler.service/self) of the type `app.bsky.labeler.service` to your account.
ja: 最後に、このアカウントをラベラーサービスとして使用することを承認します。これにより、`app.bsky.labeler.service`型の[ATレコード](https://pdsls.dev/at://did:plc:wwjhjtgw5ksxrzdswtvnsnjs/app.bsky.labeler.service/self)がアカウントに公開されます。

source: Finally, generate TypeScript schemas from the installed Lexicons:
ja: 最後に、インストールされたLexiconからTypeScriptスキーマを生成します。

source: Finally, update `app/page.tsx` to include the status picker:
ja: 最後に、`app/page.tsx`を更新してステータス選択を組み込みます。

source: Finally, you handle [moderation](/guides/moderation) by subscribing to (or running) labelers which receive user reports and publish labels on user content.
ja: 最後に、ユーザーからの報告を受け取りユーザーコンテンツにラベルを発行するラベラーを利用（または運用）して、[モデレーション](/guides/moderation)を行います。

source: Finally, you'll add functionality to display user handles and a feed of statuses from all users.
ja: 最後に、ユーザーハンドル表示と、全ユーザーのステータスフィード表示機能を追加します。

source: Finally, you'll add the runtime logic to start the server.
ja: 最後に、サーバーを起動するためのランタイムロジックを追加します。

source: Finally, you'll make one last route, to expose the `oauth-client-metadata.json` at a well-known URL. This is [used in ATProto OAuth](/specs/oauth#clients) to discover client configuration. Create `app/oauth-client-metadata.json/route.ts`:
ja: 最後にもう1つルートを作成し、`oauth-client-metadata.json`をwell-known URLで公開します。これはatproto OAuthでクライアント設定の検出に[使われます](/specs/oauth#clients)。`app/oauth-client-metadata.json/route.ts`を作成してください。

source: Finally, you'll need to generate a private key for signing. Create a script for that in `scripts/gen-key.ts`:
ja: 最後に、署名用の秘密鍵を生成する必要があります。`scripts/gen-key.ts`にスクリプトを作成します。

source: Finally, you'll need to install some additional Lexicons to get mentions. Run the following command to install and build the necessary Lexicons:
ja: 最後に、メンション取得のため追加のLexiconをインストールする必要があります。次のコマンドで必要なLexiconのインストールとビルドを行います。

source: Finance
ja: ファイナンス

source: Find Contacts
ja: 連絡先を見つける

source: Find Friends
ja: 友達を見つける

source: Find accounts to follow
ja: フォローするアカウントを探す

source: Find friends from contacts
ja: 連絡先から友達を見つける

source: Find my friends
ja: 友達を見つける

source: Find people to follow
ja: フォローするユーザーを探す

source: Find posts, users, and feeds on Bluesky
ja: Blueskyの投稿、ユーザー、フィードを検索

source: Find your friends
ja: 友達を見つける

source: Find your friends on Bluesky by verifying your phone number and matching with your contacts. We protect your information and you control what happens next. <0>Learn more</0>
ja: 電話番号を照合し、連絡先とマッチングすることであなたの友達を見つけます。私達はあなたの情報を保護し、あなたは次に何が起こるのかをコントロールできます。<0>詳細はこちら</0>

source: Find your people
ja: 仲間を探そう

source: Finding friends...
ja: 友達を見つける…

source: Finish
ja: 完了

source: First you'll build the feature that allows users to write their status to their [PDS](/guides/the-at-stack#pds). Create a new API route at `app/api/status/route.ts`:
ja: まず、ユーザーが自分の[PDS](/guides/the-at-stack#pds)にステータスを書き込める機能を作成します。`app/api/status/route.ts`に新しいAPIルートを作成してください。

source: First, add some additional imports to `lib/db/queries.ts`:
ja: まず、`lib/db/queries.ts`に追加のimportを入れます。

source: First, add the imports that you'll need, and a call to `PasswordSession.create()` to authenticate your bot using an app password:
ja: まず必要なimportを追加し、`PasswordSession.create()`を呼び出してアプリパスワードでボットを認証します。

source: First, create `lib/auth/client.ts`:
ja: まず`lib/auth/client.ts`を作成します。

source: First, install the `@atproto/lex` package:
ja: まず、`@atproto/lex`パッケージをインストールします。

source: First, provide the credentials of the account you created for your labeler service:
ja: まず、ラベラーサービス用に作成したアカウントの資格情報を指定します。

source: Fixed strings (eg `knownValues`): `kebab-case`
ja: 文字列定数（例：`knownValues`）：`kebab-case`

source: Flat Black
ja: フラット ブラック

source: Flat Blue
ja: フラット ブルー

source: Flat White
ja: フラット ホワイト

source: Focus code input
ja: コード入力にフォーカス

source: Follow
ja: フォロー

source: Follow 10 accounts
ja: 10アカウントをフォロー

source: Follow 7 accounts
ja: 7アカウントをフォロー

source: Follow account
ja: アカウントをフォロー

source: Follow all
ja: すべてフォロー

source: Follow all accounts
ja: すべてのアカウントをフォロー

source: Follow back
ja: フォローバック

source: Follow {0}
ja: {0}をフォロー

source: Follow {handle}
ja: {handle}をフォロー

source: Followed all accounts!
ja: すべてのアカウントをフォローしました！

source: Followed all matches
ja: マッチしたすべてをフォローしました

source: Followed by <0>{0}</0>
ja: <0>{0}</0>がフォロー中

source: Followed by <0>{0}</0> and <1>{1}</1>
ja: <0>{0}</0>と<1>{1}</1>がフォロー中

source: Followed by <0>{0}</0> and {1, plural, one {# other} other {# others}}
ja: <0>{0}</0>および{1, plural, other {他#人}}がフォロー中

source: Followed by <0>{0}</0>, <1>{1}</1>, and {2, plural, one {# other} other {# others}}
ja: <0>{0}</0>、<1>{1}</1>および{2, plural, other {他#人}}がフォロー中

source: Followers of @{0} that you know
ja: あなたが知っている@{0}のフォロワー

source: Followers you know
ja: あなたが知っているフォロワー

source: Following
ja: フォロー中

source: Following Feed Preferences
ja: Followingフィードの設定

source: Following feed preferences
ja: Followingフィードの設定

source: Following {0}
ja: {0}をフォローしました

source: Following {handle}
ja: {handle}をフォローしています

source: Follows You
ja: あなたをフォロー

source: Follows you
ja: あなたをフォロー

source: Font
ja: フォント

source: Font size
ja: フォントサイズ

source: Food
ja: 食べ物

source: For You
ja: あなたへ

source: For a self-controlled identity (eg, `did:web`, or `did:plc` with local rotation key), the identity update can be done directly by the user.
ja: 自己管理型のID（例：`did:web`、またはローカル回転鍵を持つ`did:plc`）の場合、IDの更新はユーザー自身が直接行うことができます。

source: For an account with a `did:plc` managed by the old PDS, a PLC "operation" is signed by the old PDS, then submitted via the new PDS. The motivation for having the new PDS submit the PLC operation instead of having the user do so directly is to give the new PDS a chance to validate the operation and do safety check to prevent the account from getting in a broken state.
ja: 旧PDSによって管理されている`did:plc`を使うアカウントの場合、PLCのオペレーションは旧PDSによって署名され、新PDS経由で提出されます。ユーザーに直接提出させるのではなく新PDSに提出させる理由は、新PDSがオペレーションを検証し、アカウントが破損状態になるのを防ぐ安全性チェックを行えるようにするためです。

source: For an active account on another PDS, this is done by generating a service auth token (JWT) signed with the current atproto signing key indicated in the identity DID document. This can be requested from the previous PDS instance using the `com.atproto.server.getServiceAuth` endpoint (or an equivalent interface/API).
ja: 別のPDSで有効なアカウントの場合、DIDドキュメントに示された現在のatproto署名鍵で署名されたサービス認証トークン（JWT）を生成することでこれを行います。これは元のPDSインスタンスに対して`com.atproto.server.getServiceAuth`エンドポイント（または同等のインターフェースやAPI）を使って要求できます。

source: For an in-depth explanation of the steps involved in a migration, read on.
ja: ここからは、移行時の詳細な処理について説明します。

source: For an independently-controlled identity (eg, `did:web`, or a `did:plc` with old PDS offline or uncooperative), this may involve updating the identity to include a self-controlled atproto signing key, and generating the service auth token offline.
ja: 独立して管理されるID（例：`did:web`、あるいは旧PDSがオフラインまたは非協力的な`did:plc`）の場合、管理下のatproto署名鍵を含めるようIDを更新したり、オフラインでサービス認証トークンを生成することが含まれる場合があります。

source: For community-contributed deployment solutions that do not use our official tooling, and may support different environments, refer to the [deploy-recipes](https://github.com/bluesky-social/deploy-recipes) Github repo. Contributions are welcome!
ja: 公式ツールを使用しない、または異なる環境をサポートするコミュニティ提供のデプロイソリューションについては、[deploy-recipes](https://github.com/bluesky-social/deploy-recipes)のGitHubリポジトリを参照してください。貢献は歓迎します！

source: For detailed views, a best practice to include the original record verbatim, instead of defining a new schema with a superset of fields. This is easier to maintain (can’t forget to update fields), and ensures any off-schema extension data is included.
ja: 詳細ビューの場合、フィールドのスーパーセットを持つ新しいスキーマを定義する代わりに、元のレコードをそのまま含めることがベストプラクティスです。これはメンテナンスが簡単で（フィールドの更新漏れはありえません）、スキーマ外の拡張データまで含まれることを保証します。

source: For each buffered event, if the rev is less than the current rev you have, you can safely skip it.
ja: バッファされた各イベントについて、そのイベントのrevが現在のrevより小さい場合、安全にスキップできます。

source: For example, an-app specific “profile” or “declaration” record can indicate that the account has logged in to an associated app at least once, even if the record is “empty”.
ja: 例えば、アプリ固有の「プロフィール」または「宣言」レコードは、たとえ空であっても存在していれば、アカウントが関連アプリに一度はログインしたことを示すことができます。

source: For example, if an endpoint can return a mix of “foo” and “bar”, and the common behavior is to include “foo” but not “bar”, then controlling parameters should be named `excludeFoo` (default `false`) and `includeBar` (default `false`), as opposed to `excludeBar` (default `true`)
ja: 例えば、エンドポイントが「foo」と「bar」の混合を返すことができ、一般的な動作は「foo」を含めるが「bar」を含めない場合、制御パラメータは`excludeFoo`（デフォルト`false`）と`includeBar`（デフォルト`false`）という名前にして、`excludeBar`（デフォルト`true`）は使いません

source: For example, your application could request a permission set like `include:com.example.authBasicFeatures?aud=did:web:api.example.com%23svc_appview`. This would resolve to a Lexicon that defines a set of permissions required for the app to function:
ja: 例えば、アプリケーションは`include:com.example.authBasicFeatures?aud=did:web:api.example.com%23svc_appview`のような権限セットtを要求できます。これはアプリの動作に必要な権限の集まりを定義するLexiconに解決されます。

source: For guidance on PLC mirroring, refer to [this developer blog](https://dholms.leaflet.pub/3m6zswymcqk2p).
ja: PLCミラーリングのガイダンスは[この開発者ブログ](https://dholms.leaflet.pub/3m6zswymcqk2p)を参照してください。

source: For guidance on scaling and hardening a PDS, refer to [Going to Production](/guides/going-to-production).
ja: PDSのスケーリングやセキュリティ強化に関する指針については、[本番環境への移行](/guides/going-to-production)を参照してください。

source: For instance, this “follow” record:
ja: 例えば、以下のようなfollowレコードについて考えます。

source: For more context, see [ATProto for distributed systems engineers](/articles/atproto-for-distsys-engineers) and [The ATProto Ethos](/articles/atproto-ethos).
ja: 詳しい背景は、[分散システムエンジニアのためのATプロトコル](/articles/atproto-for-distsys-engineers)と[The ATProto Ethos](/articles/atproto-ethos)を参照してください。

source: For more context, see [Atproto for distributed systems engineers](/articles/atproto-for-distsys-engineers) and [The ATProto Ethos](/articles/atproto-ethos).
ja: 詳しい背景は、[分散システムエンジニアのためのatproto](/articles/atproto-for-distsys-engineers)と[atprotoの基本理念](/articles/atproto-ethos)を参照してください。

source: For more guidance on working with `lex`, refer to the [readme](https://github.com/bluesky-social/atproto-internal/blob/msi/lex/packages/lex/lex/README.md#json-schemas).
ja: `lex`の使用方法に関する詳細については、[readme](https://github.com/bluesky-social/atproto-internal/blob/msi/lex/packages/lex/lex/README.md#json-schemas)を参照してください。

source: For more information, see the [Labels](/specs/label) spec.
ja: 詳細については、[ラベル](/specs/label)仕様を参照してください。

source: For most use cases, we recommend [subscribing to the firehose](/guides/streaming-data) at `com.atproto.sync.subscribeRepos`. This websocket will send you every record that is published on the network. Since Feed Generators do not need to provide hydrated posts, you can index as much or as little of the firehose as necessary. This is an important point — needing to sync with the firehose to provide a feed *can* be resource-intensive, but does not have to be. Refer to the examples linked from this guide for more details.
ja: ほとんどのユースケースでは、`com.atproto.sync.subscribeRepos`で[firehoseを取得する](/guides/streaming-data)ことをお勧めします。このwebsocketはネットワークで公開されたすべてのレコードを送信します。フィードジェネレーターはハイドレートされた投稿は提供する必要がないため、必要に応じてfirehoseから多量にも少量だけでもインデックスできます。これは重要なポイントです。フィードを提供するためにfirehoseと同期する必要があることはリソース集約的である*可能性*がありますが、そうである必要はありません。詳細については、このガイドからリンクされている例を参照してください。

source: For organizational purposes, we'll bucket these records into “collections.”
ja: 整理のため、これらのレコードをコレクションとしてまとめます。

source: For production, you need a "confidential client" instead of the loopback client you used. This requires: - a public URL - a private key for signing - public endpoints for client metadata and JWKS
ja: 本番環境では、これまでのループバッククライアントではなく「機密クライアント」が必要です。必要なものは次の通りです。 - 公開URL - 署名用の秘密鍵 - クライアントメタデータとJWKSの公開エンドポイント

source: For security reasons, we'll need to send a confirmation code to your email address.
ja: セキュリティ上の理由から、あなたのメールアドレスに確認コードを送信する必要があります。

source: For security reasons, you won't be able to view this again. If you lose this app password, you'll need to generate a new one.
ja: セキュリティ上の理由から、これを再度表示することはできません。このアプリパスワードを紛失した場合は、新しいものを生成する必要があります。

source: For strings, `knownValues` provides more flexible alternative
ja: 文字列の場合、`knownValues`はより柔軟な代替案を提供します

source: For the best experience, we recommend using the theme font.
ja: ベストな体験のために、テーマフォントの使用をお勧めします。
